app/controllers/books_controller.rb

def bookshome
    @borrowed = Borrow.pendingreturn
    @usr =[]
    @borrowed.each do |temp|
---
SELECT `borrows`.* FROM `borrows` WHERE (expected_return_date > '2015-08-31' and returned = 0)

def destroy
  Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `id` = 7
SELECT * FROM `books` WHERE (`books`.`id` = 7)

def create
  params[:book][:available]=true
  params[:book][:library_id]=current_user.library_id
  @book = Book.new(params[:book])
  if @book.save
---
INSERT INTO `books` (`name`, `author`, `available`, `created_at`, `updated_at`, `library_id`) VALUES('Pride and Prejudice ', 'Austen, Jane', 1, '2015-09-16 06:57:19', '2015-09-16 06:57:19', NULL)

def searchbooks
    @book = Book.findBook(current_user.library_id).available
---
SELECT * FROM `books` WHERE ((`books`.`available` = 1) AND (library_id = '2'))

def bookname
  if params[:button1] && params[:search]
    @searchresults = Book.searchAuthor(params[:search],current_user.library_id)
  elsif params[:button2] && params[:search]
    @searchresults = Book.searchBook(params[:search],current_user.library_id)
  else
     @searchresults = Book.find(:all)
---
SELECT * FROM `books` WHERE (name LIKE '%w%' and library_id = '2')
SELECT * FROM `libraries` WHERE (`libraries`.`id` = 2)

def allbooks
  @book=Book.findBook(current_user.library_id)
---
SELECT * FROM `books` WHERE (library_id = '2')