app/controllers/books_controller.rb

SELECT * FROM `borrows` WHERE (expected_return_date > '2015-09-23' and returned = 0)
---
def index
    @borrowed = Borrow.pendingreturn
    @usr =[]
    @borrowed.each do |temp|