app/controllers/borrows_controller.rb

INSERT INTO `borrows` (`borrow_date`, `return_date`, `returned`, `user_id`, `book_id`, `created_at`, `updated_at`, `expected_return_date`) VALUES('2015-08-26', NULL, 0, 2, 8, '2015-08-26 11:58:25', '2015-08-26 11:58:25', NULL)
UPDATE `books` SET `available` = 0, `updated_at` = '2015-08-21 05:01:37' WHERE `id` = 25
---
  def issue
    @borrow=Borrow.new(:borrow_date=>Date.today, :return_date => '', :returned =>false,
                  :user_id => current_user[:id], :book_id => params[:book_id], :expected_return_date => Date.today+10);
    if @borrow.save
      params[:id]=params[:book_id]
      Book.update(params[:id])

SELECT * FROM `books` ORDER BY books.id DESC LIMIT 1
SELECT book_id FROM `borrows` WHERE (user_id LIKE '%2%' and returned = 0)
---
  def returnbooks

    returns = Borrow.returnbook(current_user[:id])
    @returnbooks=[]
        returns.each do |temp|

SELECT * FROM `books` WHERE (`books`.`id` = 14)
UPDATE `books` SET `available` = 1, `updated_at` = '2015-08-21 09:02:01' WHERE `id` = 19
SELECT * FROM `borrows` WHERE (`borrows`.`book_id` = '14') LIMIT 1
UPDATE `borrows` SET `return_date` = '2015-08-21', `returned` = 1, `updated_at` = '2015-08-21 08:58:09' WHERE `id` = 1
---
  def returnlibrary
      b=Book.find(params[:book_id])
      b.available=true
      b.save
      b=Borrow.find_by_book_id(params[:book_id])
      b.return_date = Date.today
      b.returned = true
      b.save

SELECT * FROM `borrows` WHERE (`borrows`.`book_id` = '9') LIMIT 1
UPDATE `borrows` SET `expected_return_date` = '2015-09-11', `updated_at` = '2015-09-01 06:37:26' WHERE `id` = 12
---
  def renewlibrary
      b = Borrow.find_by_book_id(params[:book_id])
      b.expected_return_date = Date.today+10
      b.save

SELECT * FROM `books` WHERE (`books`.`id` IN (4,2))
SELECT * FROM `borrows` WHERE (user_id = 8)
SELECT * FROM `users` WHERE (`users`.`id` = 8)
---
  def historyuser
    @history = []
    Borrow.find(:all, :include => [:user, :book], :conditions => ['user_id = ?', current_user.id]).each do |temp|

SELECT * FROM `books` WHERE (`books`.`id` IN (1,4,2,3))
SELECT * FROM `borrows` WHERE (returned=0)
SELECT * FROM `users` WHERE (`users`.`id` IN (11,12,8))
---
  def historyadmin
    @unreturned = []
    Borrow.find(:all, :include => [:user, :book]).each do |temp|