app/controllers/borrows_controller.rb

  def returnbooks
    returns = Borrow.returnbook(current_user[:id])
    rbooks = []
    returns.each do |temp|
        rbooks << temp[:book_id]
    end
    @returnbooks = Book.find(rbooks)
---
SELECT * FROM `books` WHERE (`books`.`id` IN (NULL,NULL,NULL)) LIMIT 1