app/controllers/libraries_controller.rb

	def create
      @library = Library.new(params[:library])
      if @library.save
---
INSERT INTO `libraries` (`name`, `city`, `phone`, `created_at`, `updated_at`) VALUES('8015395136', NULL, NULL, '2015-09-03 06:22:15', '2015-09-03 06:22:15')

  def show
      @libraries=Library.findLibrary
---
SELECT * FROM `libraries`