app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.findAll(current_user.library_id)
---
SELECT * FROM `users` WHERE (library_id = '2')

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def new
    @user = User.new
    @title = "Sign up"
    @libraries=Library.findLibrary
---
SELECT * FROM `libraries`

  def create
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `remember_token`, `admin`, `library_id`, `superadmin`) VALUES('superadmin', 'superadmin@gmail.com', '2015-09-03 05:27:06', '2015-09-03 05:27:06', 'cde82aa755599af9b8a1bca72397c3e3dbad22a41eb56d62c166913a32cbeee3', '12742d6d1330cddf5e9420924244df9726bc80ea54739c37bb195ab5bf2f5eb4', NULL, NULL, NULL, NULL)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `email` = 'bb@gmail.com', `salt` = 'e0ba5dcd1051c92d6fa603a9f73d8a1fb5078b5b0cbfa6549db5542d7b5be9e7', `encrypted_password` = '99dc4e0ece4b76ad59b577621eb5498eef7e67dda14ab44fd810e21f9c0a4193', `updated_at` = '2015-08-19 12:17:27' WHERE `id` = 2

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE `id` = 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)